#include <iostream>
#include <locale.h>

using namespace std;

int calculateCheesePieces(int m, int n) {
    if (m == 1 || n == 1) {
        // Якщо клумба має лише один рядок або одну колонку, Анфіса збирає всі квіти 
return max(m, n);
    }
    else {
        // Загальний випадок
        return ((n-1)*(m-1) + 1); 
    }
}

int main() {
	setlocale(LC_CTYPE, "ukr");
    int m, n;

    // Menu
    int choice;
    cout << "1. ПОЧАТОК ГРИ" << endl;
    cout << "2. ІНСТРУКЦІЯ" << endl;
    cout << "3. ВИХІД" << endl;
    cout << "Введіть цифру від 1 до 3: ";
    cin >> choice;

    while (choice != 3) {
        switch (choice) {
        case 1:
            cout << "Введіть розмір поля (m n): ";
            cin >> m >> n;
            cout << "Максимально сирків які вона зіюрала: " << calculateCheesePieces(m, n) << endl;
            break;
    
            
         case 2:
            cout << "ІНСТРУКЦІЯ: Анфіса та квіти" << endl;
            cout << "------------------------------------" << endl;
            cout << "Мурзик створив квіткову клумбу у формі шахівниці з розмірами m на n." << endl;
            cout << "Кожна клітинка клумби містить одну квітку." << endl;
            cout << "Іноді Мурзик виводить Анфісу на прогулянку по клумбі ." << endl;
            cout << "Анфіса завжди розпочинає з верхнього лівого кута клумби і рухається до правого нижнього, збираючи квіти на своєму шляху." << endl;
            cout << "Після завершення прогулянки Мурзик вручає Анфісі шматочок сиру." << endl;
            cout << "У клумбі можуть бути різні розміри та кількості рядків та колонок." << endl;
            cout << "Анфіса завжи обирає найоптимальніший шлях для збору квітів, щоб отримати якнайбільше шматочків сиру." << endl;
			cout << "Під час введення розмірів клумби, введіть значення  m та n (наприклад: 2 3)" << endl;
			break;
        default:
            cout << "Ви ввели не те число ( Повторіть спробу.  " << endl;
            break;
        }

        cout << "1. ПОЧАТОК ГРИ" << endl;
    cout << "2. ІНСТРУКЦІЯ" << endl;
    cout << "3. ВИХІД" << endl;
    cout << "Введіть цифру від 1 до 3: ";
    cin >> choice;
    }

    return 0;
}
